embeddedci-com/benchpod-firmware/stm32h563/src/ethernetif.c
  PHYLinkState = LAN8742_GetLinkState(&LAN8742);

  if(netif_is_link_up(netif) && (PHYLinkState <= LAN8742_STATUS_LINK_DOWN))
  {
    HAL_ETH_Stop(&EthHandle);
    netif_set_down(netif);
    netif_set_link_down(netif);
  }
  else if(!netif_is_link_up(netif) && (PHYLinkState > LAN8742_STATUS_LINK_DOWN))
  {
    switch (PHYLinkState)
    {
    case LAN8742_STATUS_100MBITS_FULLDUPLEX:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      linkchanged = 1;
      break;
    case LAN8742_STATUS_100MBITS_HALFDUPLEX:
      duplex = ETH_HALFDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      linkchanged = 1;
      break;
    case LAN8742_STATUS_10MBITS_FULLDUPLEX:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_10M;
      linkchanged = 1;
      break;
    case LAN8742_STATUS_10MBITS_HALFDUPLEX:
      duplex = ETH_HALFDUPLEX_MODE;
      speed = ETH_SPEED_10M;
      linkchanged = 1;
      break;
    default:
      break;
    }

    if(linkchanged)
    {
      /* Get MAC Config MAC */
      HAL_ETH_GetMACConfig(&EthHandle, &MACConf);
      MACConf.DuplexMode = duplex;
      MACConf.Speed = speed;
      HAL_ETH_SetMACConfig(&EthHandle, &MACConf);
      HAL_ETH_Start(&EthHandle);
      netif_set_up(netif);
      netif_set_link_up(netif);
      uint32_t anlpar = 0;
      (void)HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_ANLPAR, &anlpar);
      printf("[net] eth link up: %s%s%s, partner 0x%04lx\r\n",
             speed == ETH_SPEED_100M ? "100M" : "10M",
             duplex == ETH_FULLDUPLEX_MODE ? " full" : " HALF",
             duplex == ETH_FULLDUPLEX_MODE ? "" : " duplex (a full-duplex switch port would mean a mismatch)",
             (unsigned long)anlpar);
    }
  }

}

/* Administratively halt the wired MAC and mark the interface down. Paired with
   ethernetif_phy_restart() to bring it back. Used by the `eth` console/JSON
   command (manual stop) — while stopped, net_server.c skips the link check so the
   interface stays down until an explicit start. */
void ethernetif_stop(struct netif *netif)
{
  HAL_ETH_Stop(&EthHandle);
  netif_set_down(netif);
  netif_set_link_down(netif);
}

/* Issue the LAN8742's own soft reset (BCR bit 15), then mark the link down so the
   next ethernet_link_check_state() re-negotiates and restarts the MAC from
   scratch. This clears a wedged PHY autoneg/PLL state that a stuck DHCP or a flaky
   link can leave behind — a full recovery WITHOUT a power cycle. Used by the DHCP
   self-heal escalation and the `eth start`/`eth restart` command. */
void ethernetif_phy_restart(struct netif *netif)
{
  HAL_ETH_Stop(&EthHandle);
  uint32_t bcr = 0;
  if (HAL_ETH_WritePHYRegister(&EthHandle, LAN8742.DevAddr,
                               LAN8742_BCR, LAN8742_BCR_SOFT_RESET) == HAL_OK) {
    uint32_t t0 = HAL_GetTick();
    do {
      if (HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr,
                                  LAN8742_BCR, &bcr) != HAL_OK) break;
    } while ((bcr & LAN8742_BCR_SOFT_RESET) && (HAL_GetTick() - t0 < 1000u));
  }
  netif_set_down(netif);
  netif_set_link_down(netif);
}

void HAL_ETH_RxAllocateCallback(uint8_t **buff)
{
  struct pbuf_custom *p = LWIP_MEMPOOL_ALLOC(RX_POOL);
  if (p)
  {
    /* Get the buff from the struct pbuf address. */
    *buff = (uint8_t *)p + offsetof(RxBuff_t, buff);
    p->custom_free_function = pbuf_free_custom;
    /* Initialize the struct pbuf.
    * This must be performed whenever a buffer's allocated because it may be
    * changed by lwIP or the app, e.g., pbuf_free decrements ref. */
    pbuf_alloced_custom(PBUF_RAW, 0, PBUF_REF, p, *buff, ETH_RX_BUFFER_SIZE);
  }
  else
  {
    if (RxAllocStatus != RX_ALLOC_ERROR) s_rx_alloc_fail++;
    RxAllocStatus = RX_ALLOC_ERROR;
    *buff = NULL;
  }
}

void HAL_ETH_RxLinkCallback(void **pStart, void **pEnd, uint8_t *buff, uint16_t Length)
{
  struct pbuf **ppStart = (struct pbuf **)pStart;
  struct pbuf **ppEnd = (struct pbuf **)pEnd;
  struct pbuf *p = NULL;

  /* Get the struct pbuf from the buff address. */
  p = (struct pbuf *)(buff - offsetof(RxBuff_t, buff));
  p->next = NULL;
  p->tot_len = 0;
  p->len = Length;

  /* Chain the buffer. */
  if (!*ppStart)
  {
    /* The first buffer of the packet. */
    *ppStart = p;
  }
  else
  {
    /* Chain the buffer to the end of the packet. */
    (*ppEnd)->next = p;
  }
  *ppEnd  = p;

  /* Update the total length of all the buffers of the chain. Each pbuf in the chain should have its tot_len
   * set to its own length, plus the length of all the following pbufs in the chain. */
  for (p = *ppStart; p != NULL; p = p->next)
  {
    p->tot_len += Length;
  }
}

void HAL_ETH_TxFreeCallback(uint32_t * buff)
{
  pbuf_free((struct pbuf *)buff);
}

/* ETH global interrupt — MspInit enables ETH_IRQn, so it must be serviced. */
void ETH_IRQHandler(void)
{
  HAL_ETH_IRQHandler(&EthHandle);
}



/* Fill `d` from the PHY (MDIO), the MAC and its MMC counters. Net task only: MDIO is not locked. */
void ethernetif_diag_refresh(struct netif *netif, eth_diag_t *d)
{
  uint32_t v = 0;
  memset(d, 0, sizeof(*d));
  d->phy_ok = true;
  /* BSR's link bit latches low: the first read reports a drop since the last read, the second now. */
  if (HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_BSR, &v) != HAL_OK ||
      HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_BSR, &v) != HAL_OK) d->phy_ok = false;
  d->bsr = (uint16_t)v;
  if (HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_PHYSCSR, &v) != HAL_OK) d->phy_ok = false;
  d->physcsr = (uint16_t)v;
  if (HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_ANLPAR, &v) != HAL_OK) d->phy_ok = false;
  d->anlpar = (uint16_t)v;
  if (HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_SECR, &v) != HAL_OK) d->phy_ok = false;
  d->symbol_errors = (uint16_t)v;

  d->maccr = ETH->MACCR;
  d->netif_link = netif_is_link_up(netif);
  d->rx_frames = s_rx_frames;
  d->rx_bcast = s_rx_bcast;
  d->rx_good = ETH->MMCRUPGR;
  d->rx_crc = ETH->MMCRCRCEPR;
  d->rx_align = ETH->MMCRAEPR;
  d->tx_good = ETH->MMCTPCGR;
  d->tx_col_single = ETH->MMCTSCGPR;
  d->tx_col_multi = ETH->MMCTMCGPR;
  uint32_t mfc = ETH->DMACMFCR;   /* clears on read */
  s_rx_missed += mfc & ETH_DMACMFCR_MFC;
  if (mfc & ETH_DMACMFCR_MFCO) s_rx_missed_ovf++;
  d->rx_missed = s_rx_missed;
  d->rx_missed_ovf = s_rx_missed_ovf;
  d->rx_alloc_fail = s_rx_alloc_fail;
  d->rx_alloc_stuck = (RxAllocStatus == RX_ALLOC_ERROR);
}
